tutorials/heatTransfer/chtMultiRegionFoam/windshieldDefrost/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionFoam;

startFrom       latestTime; // startTime;

startTime       0;

stopAt          endTime;

endTime         600;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1;

maxDeltaT       1;

functions
{
    massFlux
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         yes;
        outputControl   timeStep; //outputTime;
        outputInterval  1;
        log             yes;
        valueOutput     no;
        source          patch;
        sourceName      inlet;
        operation       sum;
        fields          (phi);
        region          cabin;
    }
}


// ************************************************************************* //
